trying to get graphs to work.
